baseCasefine2/0.org/Ut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      Ut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (1 0 0);

boundaryField
{
 "(cleft|cright)"
    {
        type            cyclicAMI;
        value           $internalField;
    }

    	freeSurface
    {
        type            pressureInletOutletParSlipVelocity;
        value           uniform (1 0 0);
    }
    "(left|right|wall)"
    {
        type            slip;
        value           uniform (1 0 0);
    }
    frontAndBack
    {
        type            slip;
        value           uniform (1 0 0);
    }
    "proc.*"
    {
        type            processor;
    }

}


// ************************************************************************* //
