baseCasefine2/0.org/nuTilda
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nuTilda;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
	 "(cleft|cright)"
    {
        type            cyclicAMI;
        value           $internalField;
    }

    	freeSurface
    {
        type            zeroGradient;
        value           uniform 0;
    }
    "(left|right|wall)"
    {
        type            zeroGradient;
        value           uniform 0;
    }
    frontAndBack
    {
        type            zeroGradient;
        value           uniform 0;
    }
    "proc.*"
    {
        type            processor;
    }

}


// ************************************************************************* //
