baseCasefine2/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0  0 0)
    (20 0 0)
    (20 5.4 0)
    ( 0 5.4 0)
    ( 0 0 12.2)
    (20 0 12.2)
    (20 5.4 12.2)
    ( 0 5.4 12.2)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (100 27 61) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    freeSurface
    {
        type wall;
        faces
        (
            (3 7 6 2)
        );
    }
    right
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
left
{
	type patch;
	faces
		(
            (2 6 5 1)
		 );
}

wall
{
	type wall;
	faces
	       	(
            (1 5 4 0)
		 );
}

    frontAndBack
    {
        type wall;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
