baseCasefine2/system/elementDataAll
// Blade element data
// axialDistance, radius, azimuth, chord, chordMount, twist
(	0	0.1	0	0.120433447141892	0.25	34.11040508342	)
(	0	0.104	0	0.125548345790541	0.25	34.0507026405925	)
(	0	0.108	0	0.131732771018152	0.25	33.7457988118812	)
(	0	0.112	0	0.134618580213291	0.25	33.0154968560844	)
(	0	0.116	0	0.136737003066068	0.25	32.2219732597819	)
(	0	0.12	0	0.138420141512016	0.25	31.4091056977597	)
(	0	0.124	0	0.139879983172387	0.25	30.6012127612953	)
(	0	0.128	0	0.141138852145733	0.25	29.8094523003325	)
(	0	0.132	0	0.142263949338318	0.25	29.0405453675229	)
(	0	0.136	0	0.143285163313955	0.25	28.295716062322	)
(	0	0.14	0	0.144312832940359	0.25	27.5674039497403	)
(	0	0.144	0	0.145153780398755	0.25	26.8758442307324	)
(	0	0.148	0	0.145885507233399	0.25	26.2061452447956	)
(	0	0.152	0	0.146538515927352	0.25	25.5485514529667	)
(	0	0.156	0	0.147132877721852	0.25	24.8963155629522	)
(	0	0.16	0	0.147370699780152	0.25	24.2643171112336	)
(	0	0.164	0	0.14746542983329	0.25	23.6409359771594	)
(	0	0.168	0	0.147438858513939	0.25	23.0249520230029	)
(	0	0.172	0	0.147310895018502	0.25	22.4235593489186	)
(	0	0.176	0	0.147123001871294	0.25	21.8332621497797	)
(	0	0.18	0	0.146848439423384	0.25	21.2590110484582	)
(	0	0.184	0	0.146490437203424	0.25	20.7070176721851	)
(	0	0.188	0	0.146101416906339	0.25	20.1632984296405	)
(	0	0.192	0	0.145512329510367	0.25	19.6576055848812	)
(	0	0.196	0	0.144908860033738	0.25	19.1567060466982	)
(	0	0.2	0	0.144249231356511	0.25	18.6826163532195	)
(	0	0.204	0	0.143568946532275	0.25	18.2145438147713	)
(	0	0.208	0	0.142786947315898	0.25	17.7761007743168	)
(	0	0.212	0	0.141997937825093	0.25	17.3414554057836	)
(	0	0.216	0	0.141160739597481	0.25	16.9329152938433	)
(	0	0.22	0	0.140323541369869	0.25	16.524375181903	)
(	0	0.224	0	0.139367394993781	0.25	16.1489032563305	)
(	0	0.228	0	0.138409191528654	0.25	15.7740032119058	)
(	0	0.232	0	0.137380368679472	0.25	15.4213727855813	)
(	0	0.236	0	0.136325690645964	0.25	15.0768957167033	)
(	0	0.24	0	0.135252098148279	0.25	14.742129960029	)
(	0	0.244	0	0.134146077921025	0.25	14.4240136734628	)
(	0	0.248	0	0.133040057693771	0.25	14.1058973868966	)
(	0	0.252	0	0.131867444650012	0.25	13.8122261980198	)
(	0	0.256	0	0.130686314095096	0.25	13.5216816435644	)
(	0	0.26	0	0.129497043339303	0.25	13.2376809144068	)
(	0	0.264	0	0.128286923465025	0.25	12.9704405810979	)
(	0	0.268	0	0.127076803590746	0.25	12.7032002477889	)
(	0	0.272	0	0.125824037661132	0.25	12.4464255258975	)
(	0	0.276	0	0.124535610670924	0.25	12.1984022535831	)
(	0	0.28	0	0.123247183680715	0.25	11.9503789812686	)
(	0	0.284	0	0.121946532191536	0.25	11.7204183870858	)
(	0	0.288	0	0.120641262408587	0.25	11.4972816925223	)
(	0	0.292	0	0.119335992625638	0.25	11.2741449979588	)
(	0	0.296	0	0.118031976491471	0.25	11.0659612785762	)
(	0	0.3	0	0.116728300870248	0.25	10.8618390488919	)
(	0	0.304	0	0.115424625249026	0.25	10.6577168192075	)
(	0	0.308	0	0.114178276263264	0.25	10.4641393504365	)
(	0	0.312	0	0.112945514342512	0.25	10.2730611100067	)
(	0	0.316	0	0.11171275242176	0.25	10.0819828695769	)
(	0	0.32	0	0.110531336436266	0.25	9.90054401719275	)
(	0	0.324	0	0.109360407289187	0.25	9.72107390302216	)
(	0	0.328	0	0.108189478142109	0.25	9.54160378885158	)
(	0	0.332	0	0.107069171765883	0.25	9.37126505977166	)
(	0	0.336	0	0.105957631134587	0.25	9.20250750436535	)
(	0	0.34	0	0.104846090503291	0.25	9.03374994895903	)
(	0	0.344	0	0.103783306040161	0.25	8.87358165587643	)
(	0	0.348	0	0.102727524979046	0.25	8.71464713606447	)
(	0	0.352	0	0.101671743917932	0.25	8.55571261625252	)
(	0	0.356	0	0.100663501254533	0.25	8.40492275433177	)
(	0	0.36	0	0.0996607527656145	0.25	8.25507419825386	)
(	0	0.364	0	0.0986580042766958	0.25	8.10522564217596	)
(	0	0.368	0	0.0977013799451981	0.25	7.96309343478845	)
(	0	0.372	0	0.0967488537531229	0.25	7.82164682632639	)
(	0	0.376	0	0.0957963275610477	0.25	7.68020021786434	)
(	0	0.38	0	0.0948887700464741	0.25	7.54608481370047	)
(	0	0.384	0	0.0939840625246474	0.25	7.41243404137005	)
(	0	0.388	0	0.0930793550028207	0.25	7.27878326903962	)
(	0	0.392	0	0.0922178578960306	0.25	7.1520643977433	)
(	0	0.396	0	0.0913580489766942	0.25	7.02561634884814	)
(	0	0.4	0	0.0904982400573578	0.25	6.89916829995299	)
(	0	0.404	0	0.0896802065329752	0.25	6.77932622592344	)
(	0	0.408	0	0.0888628264120887	0.25	6.65958747508395	)
(	0	0.412	0	0.0880457111222969	0.25	6.53988989556749	)
(	0	0.416	0	0.0872684569248489	0.25	6.42638922397582	)
(	0	0.42	0	0.0864912027274009	0.25	6.31288855238415	)
(	0	0.424	0	0.0857150341102753	0.25	6.19955412189389	)
(	0	0.428	0	0.0849757372667562	0.25	6.09186607622566	)
(	0	0.432	0	0.0842364404232371	0.25	5.98417803055742	)
(	0	0.436	0	0.0834989451300202	0.25	5.87676289865682	)
(	0	0.44	0	0.0827952520474144	0.25	5.77446840570853	)
(	0	0.444	0	0.0820915589648086	0.25	5.67217391276024	)
(	0	0.448	0	0.0813902564163868	0.25	5.57024295614506	)
(	0	0.452	0	0.0807194908018805	0.25	5.47295585070517	)
(	0	0.456	0	0.0800487251873741	0.25	5.37566874526528	)
(	0	0.46	0	0.0793808881067831	0.25	5.27882118992613	)
(	0	0.464	0	0.0787410795104097	0.25	5.18618049147078	)
(	0	0.468	0	0.0781012709140363	0.25	5.09353979301545	)
(	0	0.472	0	0.0774647900769644	0.25	5.00140218166555	)
(	0	0.476	0	0.0768535214402955	0.25	4.91307612390866	)
(	0	0.48	0	0.0762422528036266	0.25	4.82475006615178	)
(	0	0.484	0	0.0756346668871726	0.25	4.73697980463398	)
(	0	0.488	0	0.0750499691034251	0.25	4.65266382075218	)
(	0	0.492	0	0.0744652713196777	0.25	4.56834783687038	)
(	0	0.496	0	0.0738845410246474	0.25	4.48463105601075	)
(	0	0.5	0	0.0733245474047683	0.25	4.4040460996642	)
(	0	0.504	0	0.0727645537848892	0.25	4.32346114331766	)
(	0	0.508	0	0.0722087346152193	0.25	4.243510355766	)
(	0	0.512	0	0.0716716021684465	0.25	4.16639839391497	)
(	0	0.516	0	0.0711344697216737	0.25	4.08928643206394	)
(	0	0.52	0	0.0706013712728005	0.25	4.01284178415044	)
(	0	0.524	0	0.0700839360813969	0.25	3.93898819113499	)
(	0	0.528	0	0.0695665008899933	0.25	3.86513459811954	)
(	0	0.532	0	0.0690536366553392	0.25	3.7919682593687	)
(	0	0.536	0	0.0685563555942243	0.25	3.72114488797851	)
(	0	0.54	0	0.0680590745331095	0.25	3.65032151658831	)
(	0	0.544	0	0.0675665027096038	0.25	3.58020360765615	)
(	0	0.548	0	0.0670881494523841	0.25	3.51221569630625	)
(	0	0.552	0	0.0666097961951646	0.25	3.44422778495635	)
(	0	0.556	0	0.0661361660245803	0.25	3.3769582483546	)
(	0	0.56	0	0.0656752540030893	0.25	3.31162312411014	)
(	0	0.564	0	0.0652143419815984	0.25	3.24628799986568	)
(	0	0.568	0	0.0647582670593687	0.25	3.18168104110141	)
(	0	0.572	0	0.064313875185628	0.25	3.11883282081934	)
(	0	0.576	0	0.0638694833118872	0.25	3.05598460053727	)
(	0	0.58	0	0.0634280486431928	0.25	2.99360484798747	)
(	0	0.584	0	0.062993050686372	0.25	2.93224477170878	)
(	0	0.588	0	0.0625580527295512	0.25	2.87088469543009	)
(	0	0.592	0	0.0621293386985218	0.25	2.81046712396012	)
(	0	0.596	0	0.0617109560928154	0.25	2.75159912808525	)
(	0	0.6	0	0.061292573487109	0.25	2.69273113221038	)
(	0	0.604	0	0.060882475267086	0.25	2.63509983179023	)
(	0	0.608	0	0.0604817490673546	0.25	2.57886758922892	)
(	0	0.612	0	0.0600810228676232	0.25	2.52263534666761	)
(	0	0.616	0	0.0596877745166246	0.25	2.46754477222799	)
(	0	0.62	0	0.0592987434196972	0.25	2.41309806004156	)
(	0	0.624	0	0.0589097123227698	0.25	2.35865134785513	)
(	0	0.628	0	0.0585304283574379	0.25	2.30571834060625	)
(	0	0.632	0	0.0581517160532222	0.25	2.252874110886	)
(	0	0.636	0	0.0577761180824742	0.25	2.20055958762887	)
(	0	0.64	0	0.0574056447556865	0.25	2.14911669775814	)
(	0	0.644	0	0.0570351714288987	0.25	2.09767380788742	)
(	0	0.648	0	0.0566724462080935	0.25	2.04743121006959	)
(	0	0.652	0	0.0563102720522382	0.25	1.99727398006702	)
(	0	0.656	0	0.0559523475506946	0.25	1.94781938471947	)
(	0	0.66	0	0.0555971883408804	0.25	1.89882200063143	)
(	0	0.664	0	0.0552442160239652	0.25	1.85022199138013	)
(	0	0.668	0	0.0548946844335512	0.25	1.80224718793218	)
(	0	0.672	0	0.0545466729671805	0.25	1.75452633465937	)
(	0	0.676	0	0.0542026252297365	0.25	1.70746765738439	)
(	0	0.68	0	0.0538595900901211	0.25	1.66062286006683	)
(	0	0.684	0	0.0535193462513576	0.25	1.61436763868003	)
(	0	0.688	0	0.0531803655049342	0.25	1.56835998848684	)
(	0	0.692	0	0.0528437202198465	0.25	1.52281009813597	)
(	0	0.696	0	0.0525083563921253	0.25	1.47758185298181	)
(	0	0.7	0	0.0521741427149436	0.25	1.43264229507253	)
(	0	0.704	0	0.051841160287234	0.25	1.38810852393617	)
(	0	0.708	0	0.0515086391901256	0.25	1.3437411045818	)
(	0	0.712	0	0.0511769714657952	0.25	1.29974630828785	)
(	0	0.716	0	0.0508452047643609	0.25	1.25593595375183	)
(	0	0.72	0	0.0505132879791492	0.25	1.212285131822	)
(	0	0.724	0	0.0501802198291352	0.25	1.1688636372796	)
(	0	0.728	0	0.049846070585158	0.25	1.12553268126378	)
(	0	0.732	0	0.0495104274470842	0.25	1.08226951187905	)
(	0	0.736	0	0.0491724491996297	0.25	1.03904596976242	)
(	0	0.74	0	0.0488302173707064	0.25	0.995755579390797	)
(	0	0.744	0	0.0484834443049838	0.25	0.952337805238987	)
(	0	0.748	0	0.0481310999401679	0.25	0.908699818003214	)
(	0	0.752	0	0.0477716098327082	0.25	0.864716127531883	)
(	0	0.756	0	0.0474022639497933	0.25	0.820201916519	)
(	0	0.76	0	0.0470193475959471	0.25	0.774904998759306	)
(	0	0.764	0	0.0466264092171216	0.25	0.729005495037221	)
(	0	0.768	0	0.0462334708382961	0.25	0.683105991315136	)
(	0	0.772	0	0.0458405324594706	0.25	0.637206487593051	)
(	0	0.776	0	0.0454475940806452	0.25	0.591306983870966	)
(	0	0.78	0	0.0450546557018197	0.25	0.545407480148882	)
(	0	0.784	0	0.0446617173229942	0.25	0.499507976426797	)
(	0	0.788	0	0.0442687789441687	0.25	0.453608472704712	)
(	0	0.792	0	0.0438758405653432	0.25	0.407708968982628	)
(	0	0.796	0	0.0434829021865178	0.25	0.361809465260542	)
(	0	0.8	0	0.0430899638076923	0.25	0.315909961538458	)

