baseCasefine2/system/elementDataFour
(	0	0.1	0	0.120433447141892	0.25	-34.11040508342	)
(	0	0.116	0	0.136737003066068	0.25	-32.2219732597819	)
(	0	0.132	0	0.142263949338318	0.25	-29.0405453675229	)
(	0	0.148	0	0.145885507233399	0.25	-26.2061452447956	)
(	0	0.164	0	0.14746542983329	0.25	-23.6409359771594	)
(	0	0.18	0	0.146848439423384	0.25	-21.2590110484582	)
(	0	0.196	0	0.144908860033738	0.25	-19.1567060466982	)
(	0	0.212	0	0.141997937825093	0.25	-17.3414554057836	)
(	0	0.228	0	0.138409191528654	0.25	-15.7740032119058	)
(	0	0.244	0	0.134146077921025	0.25	-14.4240136734628	)
(	0	0.26	0	0.129497043339303	0.25	-13.2376809144068	)
(	0	0.276	0	0.124535610670924	0.25	-12.1984022535831	)
(	0	0.292	0	0.119335992625638	0.25	-11.2741449979588	)
(	0	0.308	0	0.114178276263264	0.25	-10.4641393504365	)
(	0	0.324	0	0.109360407289187	0.25	-9.72107390302216	)
(	0	0.34	0	0.104846090503291	0.25	-9.03374994895903	)
(	0	0.356	0	0.100663501254533	0.25	-8.40492275433177	)
(	0	0.372	0	0.0967488537531229	0.25	-7.82164682632639	)
(	0	0.388	0	0.0930793550028207	0.25	-7.27878326903962	)
(	0	0.404	0	0.0896802065329752	0.25	-6.77932622592344	)
(	0	0.42	0	0.0864912027274009	0.25	-6.31288855238415	)
(	0	0.436	0	0.0834989451300202	0.25	-5.87676289865682	)
(	0	0.452	0	0.0807194908018805	0.25	-5.47295585070517	)
(	0	0.468	0	0.0781012709140363	0.25	-5.09353979301545	)
(	0	0.484	0	0.0756346668871726	0.25	-4.73697980463398	)
(	0	0.5	0	0.0733245474047683	0.25	-4.4040460996642	)
(	0	0.516	0	0.0711344697216737	0.25	-4.08928643206394	)
(	0	0.532	0	0.0690536366553392	0.25	-3.7919682593687	)
(	0	0.548	0	0.0670881494523841	0.25	-3.51221569630625	)
(	0	0.564	0	0.0652143419815984	0.25	-3.24628799986568	)
(	0	0.58	0	0.0634280486431928	0.25	-2.99360484798747	)
(	0	0.596	0	0.0617109560928154	0.25	-2.75159912808525	)
(	0	0.612	0	0.0600810228676232	0.25	-2.52263534666761	)
(	0	0.628	0	0.0585304283574379	0.25	-2.30571834060625	)
(	0	0.644	0	0.0570351714288987	0.25	-2.09767380788742	)
(	0	0.66	0	0.0555971883408804	0.25	-1.89882200063143	)
(	0	0.676	0	0.0542026252297365	0.25	-1.70746765738439	)
(	0	0.692	0	0.0528437202198465	0.25	-1.52281009813597	)
(	0	0.708	0	0.0515086391901256	0.25	-1.3437411045818	)
(	0	0.724	0	0.0501802198291352	0.25	-1.1688636372796	)
(	0	0.74	0	0.0488302173707064	0.25	-0.995755579390797	)
(	0	0.756	0	0.0474022639497933	0.25	-0.820201916519	)
(	0	0.772	0	0.0458405324594706	0.25	-0.637206487593051	)
(	0	0.788	0	0.0442687789441687	0.25	-0.453608472704712	)
(	0	0.8	0	0.0430899638076923	0.25	-0.315909961538458	)

