baseCasefine2/system/elementDataHalf
(	0	0.1	0	0.120433447141892	0.25	34.11040508342	)
(	0	0.108	0	0.131732771018152	0.25	33.7457988118812	)
(	0	0.116	0	0.136737003066068	0.25	32.2219732597819	)
(	0	0.124	0	0.139879983172387	0.25	30.6012127612953	)
(	0	0.132	0	0.142263949338318	0.25	29.0405453675229	)
(	0	0.14	0	0.144312832940359	0.25	27.5674039497403	)
(	0	0.148	0	0.145885507233399	0.25	26.2061452447956	)
(	0	0.156	0	0.147132877721852	0.25	24.8963155629522	)
(	0	0.164	0	0.14746542983329	0.25	23.6409359771594	)
(	0	0.172	0	0.147310895018502	0.25	22.4235593489186	)
(	0	0.18	0	0.146848439423384	0.25	21.2590110484582	)
(	0	0.188	0	0.146101416906339	0.25	20.1632984296405	)
(	0	0.196	0	0.144908860033738	0.25	19.1567060466982	)
(	0	0.204	0	0.143568946532275	0.25	18.2145438147713	)
(	0	0.212	0	0.141997937825093	0.25	17.3414554057836	)
(	0	0.22	0	0.140323541369869	0.25	16.524375181903	)
(	0	0.228	0	0.138409191528654	0.25	15.7740032119058	)
(	0	0.236	0	0.136325690645964	0.25	15.0768957167033	)
(	0	0.244	0	0.134146077921025	0.25	14.4240136734628	)
(	0	0.252	0	0.131867444650012	0.25	13.8122261980198	)
(	0	0.26	0	0.129497043339303	0.25	13.2376809144068	)
(	0	0.268	0	0.127076803590746	0.25	12.7032002477889	)
(	0	0.276	0	0.124535610670924	0.25	12.1984022535831	)
(	0	0.284	0	0.121946532191536	0.25	11.7204183870858	)
(	0	0.292	0	0.119335992625638	0.25	11.2741449979588	)
(	0	0.3	0	0.116728300870248	0.25	10.8618390488919	)
(	0	0.308	0	0.114178276263264	0.25	10.4641393504365	)
(	0	0.316	0	0.11171275242176	0.25	10.0819828695769	)
(	0	0.324	0	0.109360407289187	0.25	9.72107390302216	)
(	0	0.332	0	0.107069171765883	0.25	9.37126505977166	)
(	0	0.34	0	0.104846090503291	0.25	9.03374994895903	)
(	0	0.348	0	0.102727524979046	0.25	8.71464713606447	)
(	0	0.356	0	0.100663501254533	0.25	8.40492275433177	)
(	0	0.364	0	0.0986580042766958	0.25	8.10522564217596	)
(	0	0.372	0	0.0967488537531229	0.25	7.82164682632639	)
(	0	0.38	0	0.0948887700464741	0.25	7.54608481370047	)
(	0	0.388	0	0.0930793550028207	0.25	7.27878326903962	)
(	0	0.396	0	0.0913580489766942	0.25	7.02561634884814	)
(	0	0.404	0	0.0896802065329752	0.25	6.77932622592344	)
(	0	0.412	0	0.0880457111222969	0.25	6.53988989556749	)
(	0	0.42	0	0.0864912027274009	0.25	6.31288855238415	)
(	0	0.428	0	0.0849757372667562	0.25	6.09186607622566	)
(	0	0.436	0	0.0834989451300202	0.25	5.87676289865682	)
(	0	0.444	0	0.0820915589648086	0.25	5.67217391276024	)
(	0	0.452	0	0.0807194908018805	0.25	5.47295585070517	)
(	0	0.46	0	0.0793808881067831	0.25	5.27882118992613	)
(	0	0.468	0	0.0781012709140363	0.25	5.09353979301545	)
(	0	0.476	0	0.0768535214402955	0.25	4.91307612390866	)
(	0	0.484	0	0.0756346668871726	0.25	4.73697980463398	)
(	0	0.492	0	0.0744652713196777	0.25	4.56834783687038	)
(	0	0.5	0	0.0733245474047683	0.25	4.4040460996642	)
(	0	0.508	0	0.0722087346152193	0.25	4.243510355766	)
(	0	0.516	0	0.0711344697216737	0.25	4.08928643206394	)
(	0	0.524	0	0.0700839360813969	0.25	3.93898819113499	)
(	0	0.532	0	0.0690536366553392	0.25	3.7919682593687	)
(	0	0.54	0	0.0680590745331095	0.25	3.65032151658831	)
(	0	0.548	0	0.0670881494523841	0.25	3.51221569630625	)
(	0	0.556	0	0.0661361660245803	0.25	3.3769582483546	)
(	0	0.564	0	0.0652143419815984	0.25	3.24628799986568	)
(	0	0.572	0	0.064313875185628	0.25	3.11883282081934	)
(	0	0.58	0	0.0634280486431928	0.25	2.99360484798747	)
(	0	0.588	0	0.0625580527295512	0.25	2.87088469543009	)
(	0	0.596	0	0.0617109560928154	0.25	2.75159912808525	)
(	0	0.604	0	0.060882475267086	0.25	2.63509983179023	)
(	0	0.612	0	0.0600810228676232	0.25	2.52263534666761	)
(	0	0.62	0	0.0592987434196972	0.25	2.41309806004156	)
(	0	0.628	0	0.0585304283574379	0.25	2.30571834060625	)
(	0	0.636	0	0.0577761180824742	0.25	2.20055958762887	)
(	0	0.644	0	0.0570351714288987	0.25	2.09767380788742	)
(	0	0.652	0	0.0563102720522382	0.25	1.99727398006702	)
(	0	0.66	0	0.0555971883408804	0.25	1.89882200063143	)
(	0	0.668	0	0.0548946844335512	0.25	1.80224718793218	)
(	0	0.676	0	0.0542026252297365	0.25	1.70746765738439	)
(	0	0.684	0	0.0535193462513576	0.25	1.61436763868003	)
(	0	0.692	0	0.0528437202198465	0.25	1.52281009813597	)
(	0	0.7	0	0.0521741427149436	0.25	1.43264229507253	)
(	0	0.708	0	0.0515086391901256	0.25	1.3437411045818	)
(	0	0.716	0	0.0508452047643609	0.25	1.25593595375183	)
(	0	0.724	0	0.0501802198291352	0.25	1.1688636372796	)
(	0	0.732	0	0.0495104274470842	0.25	1.08226951187905	)
(	0	0.74	0	0.0488302173707064	0.25	0.995755579390797	)
(	0	0.748	0	0.0481310999401679	0.25	0.908699818003214	)
(	0	0.756	0	0.0474022639497933	0.25	0.820201916519	)
(	0	0.764	0	0.0466264092171216	0.25	0.729005495037221	)
(	0	0.772	0	0.0458405324594706	0.25	0.637206487593051	)
(	0	0.78	0	0.0450546557018197	0.25	0.545407480148882	)
(	0	0.788	0	0.0442687789441687	0.25	0.453608472704712	)
(	0	0.796	0	0.0434829021865178	0.25	0.361809465260542	)
(	0	0.8	0	0.0430899638076923	0.25	0.315909961538458	)

