baseCasefine2/system/elementDataTen
(	0	0.1	0	0.120433447141892	0.25	34.11040508342	)
(	0	0.14	0	0.144312832940359	0.25	27.5674039497403	)
(	0	0.18	0	0.146848439423384	0.25	21.2590110484582	)
(	0	0.22	0	0.140323541369869	0.25	16.524375181903	)
(	0	0.26	0	0.129497043339303	0.25	13.2376809144068	)
(	0	0.3	0	0.116728300870248	0.25	10.8618390488919	)
(	0	0.34	0	0.104846090503291	0.25	9.03374994895903	)
(	0	0.38	0	0.0948887700464741	0.25	7.54608481370047	)
(	0	0.42	0	0.0864912027274009	0.25	6.31288855238415	)
(	0	0.46	0	0.0793808881067831	0.25	5.27882118992613	)
(	0	0.5	0	0.0733245474047683	0.25	4.4040460996642	)
(	0	0.54	0	0.0680590745331095	0.25	3.65032151658831	)
(	0	0.58	0	0.0634280486431928	0.25	2.99360484798747	)
(	0	0.62	0	0.0592987434196972	0.25	2.41309806004156	)
(	0	0.66	0	0.0555971883408804	0.25	1.89882200063143	)
(	0	0.7	0	0.0521741427149436	0.25	1.43264229507253	)
(	0	0.74	0	0.0488302173707064	0.25	0.995755579390797	)
(	0	0.78	0	0.0450546557018197	0.25	0.545407480148882	)
(	0	0.8	0	0.0430899638076923	0.25	0.315909961538458	)

