baseCasefine2/system/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  6                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


turbine
{
    type            axialFlowTurbineALSource;
    active          on;

    axialFlowTurbineALSourceCoeffs
    {
        fieldNames          (U);
        selectionMode       cellSet; // cellSet || points || cellZone
        cellSet             c1;
        origin              (10 4.246 6.1);
        axis                (-1 0 0);
        verticalDirection   (0 1 0);
        freeStreamVelocity  (1 0 0);
        tipSpeedRatio       TSR;
        rotorRadius         0.8;

        dynamicStall
        {
            active          off;
            dynamicStallModel LeishmanBeddoes;
        }

        endEffects
        {
            active          on;
            endEffectsModel Shen; // Glauert || Shen || liftingLine
            GlauertCoeffs
            {
                tipEffects  on;
                rootEffects on;
            }
            ShenCoeffs
            {
                c1          0.125;
                c2          21;
                tipEffects  on;
                rootEffects on;
            }
        }

        blades
        {
            blade1
            {
                writePerf   true;
                writeVTK   true;
                writeElementPerf true;
                nElements   44;
                elementProfiles
                (
                    cylinder
                    TU00
                    TU00
                    TU00
                    TU00
                    TU00
                    TU00
                    TU00
                    TU00
                    TU00
                    TU00
                    TU00
                    TU00
                    TU00
                    TU00
                    TU00
                    TU00
                    TU00
                    TU00
                    TU00
                    TU00
                    TU00
    		    );
                elementData
                (
                    #include "elementDataFour"
                );
            }
            blade2
            {
                $blade1;
                writePerf   false;
                writeVTK   true;
                writeElementPerf false;
                azimuthalOffset 120.0;
            }
            blade3
            {
                $blade2;
                azimuthalOffset 240.0;
            }
        }
/*
        tower
        {
            includeInTotalDrag  false; // default is false
            nElements   6;
            elementProfiles (cylinder);
            elementData
            ( // axial distance (turbine axis), height, diameter
                (-0.14 -0.82 0.09)
                (-0.14 -0.66 0.08)
                (-0.14 -0.42 0.06)
                (-0.14  0.00 0.05)
            );
        }

        hub
        {
            nElements   1;
            elementProfiles (cylinder);
            elementData
            ( // axial distance, height, diameter
                (0 0.09 0.09)
                (0 -0.09 0.09)
            );
        }
*/
        profileData
        {
            TU00
            {
                data (
			(0.000000000E+00	3.170053000E-01	1.481117000E-02)
			(1.000000000E+00	4.289612000E-01	1.518466000E-02)
			(2.000000000E+00	5.394359000E-01	1.572911000E-02)
			(3.000000000E+00	6.479287000E-01	1.645465000E-02)
			(4.000000000E+00	7.537792000E-01	1.738608000E-02)
			(5.000000000E+00	8.561177000E-01	1.855998000E-02)
			(6.000000000E+00	9.538070000E-01	2.002199000E-02)
			(7.000000000E+00	1.045151000E+00	2.184680000E-02)
			(8.000000000E+00	1.128008000E+00	2.414781000E-02)
			(9.000000000E+00	1.200536000E+00	2.709434000E-02)
			(1.000000000E+01	1.260667000E+00	3.097677000E-02)
			(1.100000000E+01	1.305415000E+00	3.619467000E-02)
			(1.200000000E+01	1.333081000E+00	4.312438000E-02)
			(1.300000000E+01	1.343772000E+00	5.200547000E-02)
			(1.400000000E+01	1.339028000E+00	6.293608000E-02)
			(1.500000000E+01	1.321425000E+00	7.591979000E-02)
		);
            }
            cylinder
            {
                data ((-180 0 1.1)(180 0 1.1));
            }
        }
    }
}

// ************************************************************************* //
