baseCasefine2/system/refineMeshDict
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.0                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "/home/penfold/mattijs/foam/mattijs2.1/run/icoFoam";
    case            "cavity";
    instance        "system";
    local           "";

    class           dictionary;
    object          refineMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

							// Cells to refine; name of cell set
set refine;

							// Type of coordinate system:
							// - global : coordinate system same for every cell. Usually aligned with
							//   x,y,z axis. Specify in globalCoeffs section below.
							// - patchLocal : coordinate system different for every cell. Specify in
							//   patchLocalCoeffs section below.
coordinateSystem global;
							//coordinateSystem patchLocal;


							// .. and its coefficients. x,y in this case. (normal direction is calculated
							// as tan1^tan2)
globalCoeffs
{
    tan1 (2 0 0);
    tan2 (0 2 0);
}

								// List of directions to refine
directions
(
normal
tan2
tan1
);

								// Whether to use hex topology. This will
								// - if patchLocal: all cells on selected patch should be hex
								// - split all hexes in 2x2x2 through the middle of edges.; in this case just cuts cell into 2 cells; cutting plane x-y at half height
useHexTopology true;

								// Cut purely geometric (will cut hexes through vertices) or take topology
								// into account. Incompatible with useHexTopology
geometricCut false;

								// Write meshes from intermediate steps
writeMesh false;

// ************************************************************************* //
